//
//  NickNameRandom.swift
//  DongJibSa
//
//  Created by heyji on 2024/01/15.
//

import Foundation

let noum: [String] = ["고양이", "강아지", "거북이", "토끼", "뱀", "사자", "호랑이", "표범", "치타", "하이에나", "기린", "코끼리", "코뿔소", "하마", "악어", "펭귄", "부엉이", "올빼미", "곰", "돼지", "소", "닭", "독수리", "타조", "고릴라", "오랑우탄", "침팬지", "원숭이", "코알라", "캥거루", "고래", "상어", "칠면조", "직박구리", "쥐", "청설모", "메추라기", "앵무새", "삵", "스라소니", "판다", "오소리", "오리", "거위", "백조", "두루미", "고슴도치", "두더지", "우파루파", "맹꽁이", "너구리", "개구리", "두꺼비", "카멜레온", "이구아나", "노루", "제비", "까치", "고라니", "수달", "당나귀", "순록", "염소", "공작", "바다표범", "들소", "박쥐", "참새", "물개", "바다사자", "살모사", "구렁이", "얼룩말", "산양", "멧돼지", "카피바라", "도롱뇽", "북극곰", "퓨마", "미어캣", "코요테", "라마", "딱따구리", "기러기", "비둘기", "스컹크", "돌고래", "까마귀", "매", "낙타", "여우", "사슴", "늑대", "재규어", "알파카", "양", "다람쥐", "담비", "사막여우", "북극여우"]
let adjective: [String] = ["검소한", "겸손한", "공손한", "관대한", "관용적인", "근심이 없는", "긍정적인", "귀여운", "낙천적인", "낭만적인", "내성적인", "느긋한", "다정한", "단호한", "대담한", "덕망 있는", "매력적인", "명랑한", "민접한", "바른", "발라한", "부지런한", "분별 있는", "사교적인", "사랑스런", "사려 깊은", "사심 없는", "상냥한", "성실한", "솔직한", "순종적인", "신중한", "싹싹한", "야망찬", "예의 바른", "온순한", "외향적인", "용감한", "거들먹거리는", "거만한", "겁 많은", "경솔한", "고집 센", "교활한", "까다로운", "끈질긴", "날카로운", "단순한", "무관심한", "무자비한", "방어적인", "변덕스런", "보수적인", "부정적인", "비관적인", "뻔뻔스러운", "사악한", "서투른", "소극적인", "수동적인", "소심한", "수다르선","수줍어하는", "시끄러운", "아첨하는", "예민한", "욱하는", "가냘픈", "가엾은", "게으른", "고마운", "너그러운", "더우룬", "뛰어난", "멋진", "못난", "무거운", "바람직한", "반가운", "부드러운", "빠른", "서툰", "성가신", "슬픈", "시원찮은", "아니꼬운", "아름다운", "약빠른", "언짢은", "예쁜", "올바른", "외로운", "의심스런", "잘난", "잘생긴", "재미있는", "점잖은", "지혜로운", "즐거운", "한결같은"]

class NickNameRandom {
    
    func getRandomNickName() -> String {
        guard let firstWord = adjective.randomElement() else { return "" }
        guard let secondWord = noum.randomElement() else { return "" }
        return "\(firstWord) \(secondWord)"
    }
}
  
